# vim: syntax=ruby filetype=ruby

#######################################
# Taps
#######################################
# taps are shared, as any package "might" be needed
#
tap "cristianoliveira/tap"    # aerospace-scratchpad
tap "felixkratz/formulae"     # sketchybar
tap "nikitabobko/tap"         # aerospace
tap "keith/formulae"          # reminders-cli
tap "oschrenk/made"           # tools created by myself
tap "oschrenk/personal"       # casks/formula managed by me
tap "sass/sass"               # sass
tap "txn2/tap"                # kubefwd

# You can list all packages installed via `brew leaves`

#######################################
# Bootstrap priorities
#######################################
# having these installed early in the bootstrapping process allows
# to already configure and use services and applications while brew
# keeps installing other packages
#
brew "atuin"     # cli, improved shell history
brew "fd"        # system, generic, fast find alternative
brew "findutils" # system, generic, GNU g-prefixed `find`, xargs`
brew "fzf"       # fuzzy finder
brew "oschrenk/made/sessionizer" # tmux, manage sessions
brew "neovim"    # editor
brew "ripgrep"   # system, generic, recursive search
brew "starship"  # prompt
brew "mas"       # Mac App Store command-line interface
brew "tmux"      # cli, terminal multiplexer

{{ if has "gui" .tags -}}
cask "1password"          # password manager
cask "aerospace"          # window manager
cask "arc"                # chromium based browser
cask "ghostty"            # terminal
cask "intellij-idea"      # jetbrains ide
cask "karabiner-elements" # customize keyboard
cask "obsidian"           # notes
cask "spotify"            # audio client
{{ end -}}

#######################################
# Xcode
#######################################
# Installing XCode is VERY slow, but it
# is required by a handful of packages
#
{{ if has "gui" .tags -}}
# Only on Personal machine
brew "xcodes"      # xcode & runtimes manager
mas "XCode", id: 497799835
mas "Apple Developer", id: 640199958
{{ end -}}

#######################################
# Packages
#######################################
#
# core (cli)
brew "blueutil"      # system, get/set bluetooth from terminal
brew "coreutils"     # system, GNU core utilities
brew "curl"          # system, download things
brew "direnv"        # system, auto load env
brew "gawk"          # system, GNU awk utility
brew "htop"          # system, improved top
brew "lsd"           # system, "better" ls
brew "page"          # system, Use Neovim as pager
brew "rclone"        # system, sync files
brew "rsync"         # system, sync files
brew "tree"          # system, print file tree
brew "watch"         # system, issue commands at regular interval
brew "smartmontools" # hardware, harddrive, read ssd info
brew "telnet"        # network, telnet protocol

# extra (cli)
brew "shellcheck"    # shell, linter
brew "witr"          # cli, why is this running

# crypto
brew "croc"          # cryptography, secure data transfer
brew "minisign"      # cryptography, sign files and verify signatures

# productivity
brew "keith/formulae/reminders-cli" # cli, reminders
brew "glow"          # cli, render markdown in terminal
brew "oschrenk/made/plan" # cli, fetch next event
brew "zola"          # web, blogging engine

{{ if has "server" .tags -}}
brew "oschrenk/personal/obsidian-headless" # cli
brew "oschrenk/personal/msgvault" # cli, archive email
{{ end -}}

# ai
brew "llm"           # ai, llm on cli
brew "ollama"        # ai, local models
brew "oschrenk/personal/dora" # ai, navigate code with scip
brew "oschrenk/made/meter" # ai, claude, measure usage
brew "tweakcc"       # ai, claude, customize

# data
brew "jd"            # data, diff JSON
brew "jq"            # data, process JSON (read/transform)
brew "jsongrep"      # data, process JSON (read only)
brew "mdq"           # data, process markdown like jq
brew "miller"        # data, process CSV
brew "xq"            # data, process xml
brew "yq"            # data, process YAML

# database
brew "lazysql"       # cli, sql
brew "libpq"         # postgres, cli
brew "pgformatter"   # postgres, formatter

# development
brew "prettier"      # generic, code formatter
brew "prettierd"     # generic, code formatter
brew "go-task"       # generic, go-based task runner
brew "yamlfmt"       # yaml, formatter

# editor
brew "tree-sitter-cli" # nvim, requirement

# git
brew "git-crypt"     # git, encrypt secrets in git
brew "git-delta"     # git, better looking diffs
brew "git-extras"    # git, nice git extras
brew "git-open"      # git, open git[hub/lab] urls
brew "gh"            # cli, interact with github
brew "glab"          # git, gitlab cli
brew "oschrenk/made/arbol" # git, repository manager
brew "oschrenk/made/infuse" # git, repository mixer
brew "worktrunk"     # git, worktree managment

# golang
brew "go"            # go, language
brew "golangci-lint" # go, linter runner
brew "gopls"         # go, lsp

# k8
brew "helm"          # k8s, package manager
brew "k9s"           # k8s, cluster manager
brew "krew"          # k8s, kubectl package manager
brew "kube-linter"   # k8s, lint k8s yaml and helm
brew "kubectx"       # k8s, switch k8s contexts
brew "kubernetes-cli"# k8s, cli
brew "kubescape"     # k8s, scan cluster for security issues
brew "kustomize"     # k8s, resource transformers
brew "minikube"      # k8s, run local k8s
brew "txn2/tap/kubefwd" # k8s, bulk port forwarding

# kotlin
brew "kotlin"        # kotlin
brew "ktfmt"         # kotlin, formatter
brew "ktlint"        # kotlin, formatter

# lua
brew "lua"                 # lua, programming language
brew "lua-language-server" # lua, lsp
brew "luarocks"            # lua, package manager
brew "stylua"              # lua formatter

# web (javascript, typescript, css, ...)
brew "fnm"           # javascript, version manger
brew "hurl"          # network, run/test http requests
brew "node"          # javascript, language
brew "oschrenk/made/cutter" # web, extract cookies
brew "oven-sh/bun/bun" # javascript runtime
brew "sass/sass/sass" # js, sass
brew "typescript"    # typescript, language
brew "typescript-language-server" # typescript, lsp
brew "yarn"          # javascript, package manager

# jvm
brew "openjdk@17"    # jvm, sdk
brew "openjdk@21"    # jvm, sdk
brew "openjdk"       # jvm, sdk
brew "oschrenk/personal/scip" # cli, source indexer
brew "oschrenk/personal/scip-typescript" # cli, index ts

# pkl
brew "pkl"           # pkl, language
brew "pkl-lsp"       # pkl, lsp

# python
brew "poetry"        # python, package manager
brew "pyenv"         # python, version manager
brew "python@3.13"   # python, language
brew "python@3.14"   # python, language

# rust
brew "rust"          # rust, language

# swift
brew "swiftformat"   # swift, format
brew "swiftlint"     # swift, lint, requires Xcode
brew "swiftly"       # swift, toolchain manager

# only on work machine
{{ if has "work" .tags -}}
brew "awscli"      # devops, aws
brew "flyway"    # sql, database migrations
brew "gradle"    # kotlin, build tool
brew "hadolint"  # docker, linter
brew "jira-cli"  # cli, interact with jira
brew "kubelogin" # k8s, openid auth plugin
brew "logcli"    # o11y, query loki
brew "mysql-client@8.0" # mysql, client
brew "skopeo"    # docker, registry inspect
brew "sleek"     # sql, formatter
brew "snyk-cli"  # security, cli, scan for security vulnerabilities
brew "sqlfluff"  # sql, formatter
brew "stern"     # k8s, log "aggregator"
brew "traefik"   # k8s, reverse proxy
brew "velero"    # k8s, backup/recovery
brew "websocat"  # cli, websocket
{{ end -}}

# only on personal machine
brew "asciinema"   # a/v, record terminal sessions
brew "coursier"    # jvm, scala, artifact fetching
brew "doggo"       # network, dns client
brew "exiftool"    # a/v, read/write exif
brew "ffmpeg"      # a/v, convert audio/video
brew "flac"        # a/v, flac codec
brew "gallery-dl"  # a/v, downlaod gallery
brew "httrack"     # network, copy websites offline
brew "lame"        # a/v, mp3 codec
brew "libmp3splt"  # a/v, split mp3, off, flac files
brew "meli"        # terminal, email client
brew "mosh"        # network, better shell for roaming
brew "ngrep"       # network, packet analyzer
brew "nmap"        # network,port scanning
brew "pandoc"      # docs, document converter
brew "poppler"     # pdf, engine and extractor
brew "sbt"         # jvm, scala
brew "scala"       # jvm, scala
brew "tag"         # terminal, interact with macOS file tags
brew "tfenv"       # devops, terraform version manager
brew "typst"       # typst, tex alternative (rust based)
brew "uv"          # python package manager
brew "x264"        # a/v, h264 encoder
brew "xvid"        # a/v, mp4 lib
brew "yt-dlp"      # a/v, download youtube video/audio

#######################################
# BREWS (GUI-dependent)
#######################################
{{ if has "gui" .tags -}}
cask "alcove"        # macos, notch helper
brew "cristianoliveira/tap/aerospace-scratchpad" # aerospace, scratchpad
brew "chrome-cli"    # cli, control chrome via cli
brew "displayplacer" # macos, arrange monitors
brew "fileicon"      # macos, manage icons
brew "iconsur"       # macos, fetch icons
brew "infat"         # macos, set default filetypes
brew "kanata"        # system, keyboard mapper
brew "m1ddc"         # hardware, monitor control
brew "oschrenk/made/keyboard" # hardware, control keyboard brightness of macbooks
brew "oschrenk/made/mission" # macos, task managment
brew "oschrenk/made/nightshift" # hardware, control Night Shift
brew "oschrenk/made/wallpaper" # macos, set wallpaper
brew "sketchybar"    # macos, custom statusbar
brew "spicetify-cli" # spotify ricing
{{ end -}}

#######################################
# Apps
#######################################
{{ if has "gui" .tags -}}
mas "DeskRest", id: 6751417411             # health
mas "Due", id: 524373870                   # reminders on steroid
mas "Keynote", id: 409183694               # make slides
mas "Klack", id: 6446206067                # keyboard
mas "NextDNS", id: 1464122853              # dns blocking
mas "NordVPN", id: 905953485               # NordVPN
# mas "Numbers", id: 409203825               # excel
# mas "Pages", id: 409201541                 # docs
mas 'Parcel', id: 375589283                # Shipment tracking
mas "Reeder", id: 1529448980               # rss
{{ end -}}

# install on server for access to health data
mas "Health Auto Export", id: 1115567069   # export apple health data

#######################################
# Safari extensions
#######################################
{{ if has "gui" .tags -}}
mas "1Password for Safari", id: 1569813296
mas "Dark Reader for Safari", id: 1438243180
mas "DeArrow", id: 6451469297
mas "Obsidian Web Clipper", id: 6720708363
mas "SponsorBlock", id: 1573461917
mas "Vimlike", id: 1584519802
mas "uBlock Origin Lite", id: 6745342698
{{ end -}}

#######################################
# Fonts
#######################################
# fonts are cheap

cask "sf-symbols"  # preview sf symbols
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-open-sans"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-sf-pro"
cask "oschrenk/personal/font-sf-mono-nerd-font"

#######################################
# Casks
#######################################

cask "claude-code"            # ai, claude
brew "container"              # cli, containerization from Apple

{{ if has "work" .tags -}}
cask "gcloud-cli"             # cloud, google cloud cli including gcloud
{{ end -}}

{{ if has "gui" .tags -}}
cask "antinote"               # notes with SoulverCore
cask "calibre"               # ebook manager
cask "discord"               # discord client
cask "firefox"                # browser
cask "google-chrome"          # browser
cask "handbrake-app"         # video transcoder
cask "hex-fiend"             # hex editor
cask "huggingchat"            # chat client for local llm
cask "iina"                  # video client
cask "jdk-mission-control"    # monitor java applications
cask "keyboardcleantool"      # disables keyboard for cleaning
cask "keycastr"              # shows key strokes on screen
cask "knockknock"            # identify background tasks/processes
cask "mochi"                 # study notes and flashcards
cask "monodraw"               # draw ascii diagrams
cask "neovide-app"            # neovim desktop app
cask "numi"                  # calculator
cask "omnidisksweeper"       # cleanup disk space
cask "onyx"                  # macos maintenance
cask "pika"                   # Color Picker
cask "shortcat"               # macos, vim picker
cask "signal"                # signal messaging
cask "slack"                 # slack office communication
cask "telegram"              # telegram messaging
cask "the-unarchiver"        # unarchiving most archive files
cask "transmission"          # torrent client
cask "vlc"                   # video client
cask "whatsapp"              # whatsapp messaging
cask "yellowdot"              # Hide screen/audio indicator

  # Only on thicc machine (MacBook Pro)
  {{ if has "thicc" .tags -}}
  cask "8bitdo-ultimate-software" # controller
  cask "elgato-control-center" # elgato software to control lights
  cask "live-home-3d"          # home designer
  cask "rode-central"          # rode companion app (for AI-1)
  cask "steam"                 # games
  mas "Affinity Designer 2", id: 1616831348  # vector editing
  mas "Affinity Photo 2", id: 1616822987     # raster editing
  mas "Affinity Publisher 2", id: 1606941598 # book publishing
  {{ end -}} # of has "thicc"

  # Only on Work machine
  {{ if has "work" .tags -}}
  cask "dbeaver-community"      # sql client
  cask "docker-desktop"         # docker client
  cask "openvpn-connect"       # vpn
  {{ end -}} # of has "work"
{{ end -}} # of has "gui"

